In [1]:
import pandas as pd
import numpy as np

In [2]:
#Loading the dataset:

data = pd.read_csv("AB_NYC_2019.csv")
data.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0

### Features

For the rest of the homework, you'll need to use the features from the previous homework with additional two `'neighbourhood_group'` and `'room_type'`. So the whole feature set will be set as follows:

* `'neighbourhood_group'`,
* `'room_type'`,
* `'latitude'`,
* `'longitude'`,
* `'price'`,
* `'minimum_nights'`,
* `'number_of_reviews'`,
* `'reviews_per_month'`,
* `'calculated_host_listings_count'`,
* `'availability_365'`

Select only them and fill in the missing values with 0.

In [26]:
new_data = data[['neighbourhood_group','room_type','latitude', 'longitude', 'price', 'minimum_nights','number_of_reviews', 'reviews_per_month', 'calculated_host_listings_count','availability_365']]
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48895 entries, 0 to 48894
Data columns (total 10 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   neighbourhood_group             48895 non-null  object
 1   room_type                       48895 non-null  object
 2   latitude                        48895 non-null  float64
 3   longitude                       48895 non-null  float64
 4   price                           48895 non-null  int64
 5   minimum_nights                  48895 non-null  int64
 6   number_of_reviews               48895 non-null  int64
 7   reviews_per_month               38843 non-null  float64
 8   calculated_host_listings_count  48895 non-null  int64
 9   availability_365                48895 non-null  int64
dtypes: float64(3), int64(5), object(2)
memory usage: 3.4+ MB

In [27]:
new_data.isnull().sum()

neighbourhood_group                   0
room_type                             0
latitude                              0
longitude                             0
price                                 0
minimum_nights                        0
number_of_reviews                     0
reviews_per_month                 10052
calculated_host_listings_count        0
availability_365                      0
dtype: int64

In [28]:
new_data['reviews_per_month']= new_data['reviews_per_month'].fillna(0)
new_data.isnull().sum()

C:\Users\merve\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

neighbourhood_group               0
room_type                         0
latitude                          0
longitude                         0
price                             0
minimum_nights                    0
number_of_reviews                 0
reviews_per_month                 0
calculated_host_listings_count    0
availability_365                  0
dtype: int64

### Question 1

What is the most frequent observation (mode) for the column `'neighbourhood_group'`?

In [29]:
print('The most frequent observation for the column neighbourhood_group is', new_data['neighbourhood_group'].mode())

The most frequent observation for the column neighbourhood_group is 0    Manhattan
dtype: object

### Split the data

* Split your data in train/val/test sets, with 60%/20%/20% distribution.
* Use Scikit-Learn for that (the `train_test_split` function) and set the seed to 42.
* Make sure that the target value ('price') is not in your dataframe.

In [199]:
from sklearn.model_selection import train_test_split

X = new_data.drop(['price'], axis=1)
y = new_data["price"]


X_full_train, X_test, y_full_train, y_test=train_test_split(X, y, test_size = 0.2, random_state=42) #Data is divided only 2 parts with this code(80% for train, 20% for test)
X_train, X_val, y_train, y_val=train_test_split(X_full_train, y_full_train, test_size = 0.2, random_state=42) #Now, train data is divided 2 parts to create validation set

In [200]:
X_train = X_train.reset_index(drop=True)
X_val = X_val.reset_index(drop=True)
X_test = X_val.reset_index(drop=True)

### Question 2

* Create the [correlation matrix](https://www.google.com/search?q=correlation+matrix) for the numerical features of your train dataset.
   * In a correlation matrix, you compute the correlation coefficient between every pair of features in the dataset.
* What are the two features that have the biggest correlation in this dataset?

In [36]:
X_train.corr()

,latitude,longitude,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365
latitude,1.000000,0.082567,0.024824,-0.007411,-0.009479,0.019051,-0.006793
longitude,0.082567,1.000000,-0.061049,0.055967,0.134702,-0.116155,0.083446
minimum_nights,0.024824,-0.061049,1.000000,-0.074459,-0.118436,0.114218,0.136383
number_of_reviews,-0.007411,0.055967,-0.074459,1.000000,0.591234,-0.072782,0.174931
reviews_per_month,-0.009479,0.134702,-0.118436,0.591234,1.000000,-0.047711,0.166007
calculated_host_listings_count,0.019051,-0.116155,0.114218,-0.072782,-0.047711,1.000000,0.226329
availability_365,-0.006793,0.083446,0.136383,0.174931,0.166007,0.226329,1.000000

The *number of reviews* and *reviews_per_month* has the highest correlation score as 0.59.

### Make price binary

* We need to turn the price variable from numeric into binary.
* Let's create a variable `above_average` which is `1` if the price is above (or equal to) `152`.

In [123]:
y_train =pd.DataFrame(y_train)
y_train1 = y_train #not to lose original train set with price
y_train1['above_average'] = y_train1['price'] >= 152
y_train1

       price  above_average
32249    125          False
15113    149          False
23032    287           True
21109     77          False
23025    133          False
...      ...            ...
13198     50          False
14583    125          False
6168     299           True
12248     65          False
20523     92          False

[31292 rows x 2 columns]

In [124]:
y_train1['above_average'] = y_train1.above_average.astype(int)
y_train1

       price  above_average
32249    125              0
15113    149              0
23032    287              1
21109     77              0
23025    133              0
...      ...            ...
13198     50              0
14583    125              0
6168     299              1
12248     65              0
20523     92              0

[31292 rows x 2 columns]

In [125]:
y_val =pd.DataFrame(y_val)
y_val1 = y_val
y_val1['above_average'] = y_val1['price'] >= 152
y_val1['above_average'] = y_val1.above_average.astype(int)
y_val1

       price  above_average
27408     65              0
7741      89              0
4771     200              1
1719     120              0
19153    748              1
...      ...            ...
44145     75              0
17550    100              0
12622     48              0
9644     386              1
29925     50              0

[7824 rows x 2 columns]

In [126]:
y_test =pd.DataFrame(y_test)
y_test1 = y_test
y_test1['above_average'] = y_test1['price'] >= 152
y_test1['above_average'] = y_test1.above_average.astype(int)
y_test1

       price  above_average
879       89              0
44383     30              0
15394    120              0
43230    470              1
16332    199              1
...      ...            ...
20477    215              1
44969    100              0
36577     70              0
11477    500              1
1023     125              0

[9779 rows x 2 columns]

### Question 3

* Calculate the mutual information score with the (binarized) price for the two categorical variables that we have. Use the training set only.
* Which of these two variables has bigger score?
* Round it to 2 decimal digits using `round(score, 2)`

In [62]:
from sklearn.metrics import mutual_info_score

In [80]:
round(mutual_info_score(X_train.room_type, y_train1.above_average),2)

0.14

In [81]:
round(mutual_info_score(X_train.neighbourhood_group, y_train1.above_average),2)

0.05

Room type has the bigger mutual score with binarized price variable.

### Question 4

* Now let's train a logistic regression
* Remember that we have two categorical variables in the data. Include them using one-hot encoding.
* Fit the model on the training dataset.
   * To make sure the results are reproducible across different versions of Scikit-Learn, fit the model with these parameters:
   * `model = LogisticRegression(solver='liblinear', C=1.0, random_state=42)`
* Calculate the accuracy on the validation dataset and rount it to 2 decimal digits.

In [82]:
new_data.columns

Index(['neighbourhood_group', 'room_type', 'latitude', 'longitude', 'price',
       'minimum_nights', 'number_of_reviews', 'reviews_per_month',
       'calculated_host_listings_count', 'availability_365'],
      dtype='object')

In [86]:
categorical = ['neighbourhood_group', 'room_type']
numerical = [ 'latitude', 'longitude',
       'minimum_nights', 'number_of_reviews', 'reviews_per_month',
       'calculated_host_listings_count', 'availability_365']

In [203]:
#ONE HOT ENCODING

from sklearn.feature_extraction import DictVectorizer

train_dict = X_train[categorical + numerical].to_dict(orient='records')

In [204]:
train_dict[0]

{'neighbourhood_group': 'Brooklyn',
 'room_type': 'Entire home/apt',
 'latitude': 40.71754,
 'longitude': -73.95906,
 'minimum_nights': 2,
 'number_of_reviews': 15,
 'reviews_per_month': 1.14,
 'calculated_host_listings_count': 1,
 'availability_365': 0}

In [205]:
dv = DictVectorizer(sparse=False)
dv.fit(train_dict)

DictVectorizer(sparse=False)

In [206]:
X_train = dv.transform(train_dict)
print(X_train.shape)
print(X_train)

(31292, 15)
[[  0.        1.       40.71754 ...   1.        0.        0.     ]
 [326.        1.       40.78784 ...   1.        0.        0.     ]
 [324.        1.       40.7358  ...   1.        0.        0.     ]
 ...
 [ 88.        1.       40.79994 ...   0.        1.        0.     ]
 [  0.        1.       40.69585 ...   0.        1.        0.     ]
 [281.        2.       40.64438 ...   1.        0.        0.     ]]

In [207]:
dv.get_feature_names()

['availability_365',
 'calculated_host_listings_count',
 'latitude',
 'longitude',
 'minimum_nights',
 'neighbourhood_group=Bronx',
 'neighbourhood_group=Brooklyn',
 'neighbourhood_group=Manhattan',
 'neighbourhood_group=Queens',
 'neighbourhood_group=Staten Island',
 'number_of_reviews',
 'reviews_per_month',
 'room_type=Entire home/apt',
 'room_type=Private room',
 'room_type=Shared room']

In [174]:
y_train1 = y_train1[['above_average']]
y_train1

       above_average
32249              0
15113              0
23032              1
21109              0
23025              0
...              ...
13198              0
14583              0
6168               1
12248              0
20523              0

[31292 rows x 1 columns]

In [152]:
#TRAINING LOGISTIC REGRESSION

from sklearn.linear_model import LogisticRegression

model = LogisticRegression(solver='liblinear', C=1.0, random_state=42)
model.fit(X_train, y_train1)

C:\Users\merve\Anaconda3\lib\site-packages\sklearn\utils\validation.py:72: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

LogisticRegression(random_state=42, solver='liblinear')

In [209]:
val_dict = X_val[categorical + numerical].to_dict(orient='records')
dv = DictVectorizer(sparse=False)
dv.fit(val_dict)

X_val = dv.transform(val_dict)
X_val.shape

(7824, 15)

In [112]:
print(y_val)
y_val1 = y_val[['above_average']]

       price  above_average
27408     65              0
7741      89              0
4771     200              1
1719     120              0
19153    748              1
...      ...            ...
44145     75              0
17550    100              0
12622     48              0
9644     386              1
29925     50              0

[7824 rows x 2 columns]

In [111]:
from sklearn.metrics import accuracy_score
y_pred = model.predict(X_val)
round(accuracy_score(y_val1,y_pred),2)

0.79

### Question 5

* We have 9 features: 7 numerical features and 2 categorical.
* Let's find the least useful one using the *feature elimination* technique.
* Train a model with all these features (using the same parameters as in Q4).
* Now exclude each feature from this set and train a model without it. Record the accuracy for each model.
* For each feature, calculate the difference between the original accuracy and the accuracy without the feature. 
* Which of following feature has the smallest difference? 
   * `neighbourhood_group`
   * `room_type` 
   * `number_of_reviews`
   * `reviews_per_month`

> **note**: the difference doesn't have to be positive

In [177]:
#Model without neighbourhood_group
model1 = LogisticRegression(solver='liblinear', C=1.0, random_state=42)
model1.fit(np.delete(X_train, [5,6,7,8,9], 1), y_train1)

C:\Users\merve\Anaconda3\lib\site-packages\sklearn\utils\validation.py:72: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

LogisticRegression(random_state=42, solver='liblinear')

In [144]:
y_val1 = y_val1[['above_average']]

In [179]:
y_pred1 = model1.predict(np.delete(X_val, [5,6,7,8,9], 1))
round(accuracy_score(y_val1,y_pred1),2)

0.75

In [180]:
#Model without room_type
model1 = LogisticRegression(solver='liblinear', C=1.0, random_state=42)
model1.fit(np.delete(X_train, [12,13,14], 1), y_train1)

y_pred1 = model1.predict(np.delete(X_val, [12,13,14], 1))
round(accuracy_score(y_val1,y_pred1),2)

C:\Users\merve\Anaconda3\lib\site-packages\sklearn\utils\validation.py:72: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

0.73

In [181]:
#Model without number_of_reviews
model1 = LogisticRegression(solver='liblinear', C=1.0, random_state=42)
model1.fit(np.delete(X_train, 10, 1), y_train1)

y_pred1 = model1.predict(np.delete(X_val, 10, 1))
round(accuracy_score(y_val1,y_pred1),2)

C:\Users\merve\Anaconda3\lib\site-packages\sklearn\utils\validation.py:72: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

0.79

In [182]:
#Model without reviews_per_month
model1 = LogisticRegression(solver='liblinear', C=1.0, random_state=42)
model1.fit(np.delete(X_train, 11, 1), y_train1)

y_pred1 = model1.predict(np.delete(X_val, 11, 1))
round(accuracy_score(y_val1,y_pred1),2)

C:\Users\merve\Anaconda3\lib\site-packages\sklearn\utils\validation.py:72: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

0.79

number_of_reviews and reviews_per_month does not change the global accuracy.

### Question 6

* For this question, we'll see how to use a linear regression model from Scikit-Learn
* We'll need to use the original column `'price'`. Apply the logarithmic transformation to this column.
* Fit the Ridge regression model on the training data.
* This model has a parameter `alpha`. Let's try the following values: `[0, 0.01, 0.1, 1, 10]`
* Which of these alphas leads to the best RMSE on the validation set? Round your RMSE scores to 3 decimal digits.

If there are multiple options, select the smallest `alpha`.

In [183]:
from sklearn.linear_model import Ridge

In [184]:
def rmse(y, y_pred):
    error = y - y_pred
    se = error ** 2
    mse = se.mean()
    return np.sqrt(mse)

In [186]:
y_train = pd.DataFrame(y_train)
y_train

       price
32249    125
15113    149
23032    287
21109     77
23025    133
...      ...
13198     50
14583    125
6168     299
12248     65
20523     92

[31292 rows x 1 columns]

In [187]:
#Log Transformation on Price
y_train = np.log(y_train['price'])
y_train

C:\Users\merve\Anaconda3\lib\site-packages\pandas\core\arraylike.py:364: RuntimeWarning: divide by zero encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

32249    4.828314
15113    5.003946
23032    5.659482
21109    4.343805
23025    4.890349
           ...
13198    3.912023
14583    4.828314
6168     5.700444
12248    4.174387
20523    4.521789
Name: price, Length: 31292, dtype: float64

In [188]:
y_train=pd.DataFrame(y_train)
y_train

          price
32249  4.828314
15113  5.003946
23032  5.659482
21109  4.343805
23025  4.890349
...         ...
13198  3.912023
14583  4.828314
6168   5.700444
12248  4.174387
20523  4.521789

[31292 rows x 1 columns]

In [191]:
y_val = np.log(y_val['price'])
y_val=pd.DataFrame(y_val)
y_val

          price
27408  4.174387
7741   4.488636
4771   5.298317
1719   4.787492
19153  6.617403
...         ...
44145  4.317488
17550  4.605170
12622  3.871201
9644   5.955837
29925  3.912023

[7824 rows x 1 columns]

In [193]:
y_test = np.log(y_test['price'])
y_test=pd.DataFrame(y_test)
y_test

C:\Users\merve\Anaconda3\lib\site-packages\pandas\core\arraylike.py:364: RuntimeWarning: divide by zero encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)

          price
879    4.488636
44383  3.401197
15394  4.787492
43230  6.152733
16332  5.293305
...         ...
20477  5.370638
44969  4.605170
36577  4.248495
11477  6.214608
1023   4.828314

[9779 rows x 1 columns]

In [201]:
X_train = pd.DataFrame(X_train)
X_train

,neighbourhood_group,room_type,latitude,longitude,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365
0,Brooklyn,Entire home/apt,40.71754,-73.95906,2,15,1.14,1,0
1,Manhattan,Entire home/apt,40.78784,-73.94998,5,88,2.23,1,326
2,Manhattan,Entire home/apt,40.73580,-73.98890,1,68,2.67,1,324
3,Brooklyn,Private room,40.70921,-73.94144,1,2,0.07,1,0
4,Manhattan,Entire home/apt,40.72410,-73.98959,7,9,0.35,1,0
...,...,...,...,...,...,...,...,...,...
31287,Brooklyn,Private room,40.71748,-73.95685,6,5,0.13,1,0
31288,Brooklyn,Private room,40.66397,-73.98538,1,7,0.17,2,0
31289,Manhattan,Private room,40.79994,-73.97001,1,1,0.64,1,88
31290,Brooklyn,Private room,40.69585,-73.96344,60,0,0.00,1,0
31291,Brooklyn,Entire home/apt,40.64438,-73.95484,7,15,0.49,2,281

In [212]:
#Ridge Regression
from sklearn.linear_model import Ridge

for a in [0, 0.01, 0.1, 1, 10]:
    clf = Ridge(alpha=a)
    clf.fit(X_train, y_train)
    
    y_pred = clf.predict(X_val)
    rmse_score = rmse(y_val, y_pred)
    
    print('RMSE for',a,'is', rmse_score)

RMSE for 0 is 210.888191748839
RMSE for 0.01 is 210.88681941505604
RMSE for 0.1 is 210.8868613978482
RMSE for 1 is 210.88796928676265
RMSE for 10 is 210.9358645418637

All RMSEs are very close to each other, however the minimum one belongs to alpha=0.01